Repository: vikas7-dt/flutter_kidsflix_testing
Catalog: lib/l10n/app_*.arb
Languages: ar, fr

# one_month_plan
source: 1 Month Plan
ar: اشتراك لمدة شهر
fr: Plan d'un mois

# six_months_plan
source: 6 Months Plan
ar: اشتراك لمدة ٦ أشهر
fr: Plan de 6 mois

source: Activate
ar: تفعيل
fr: Activer

source: Add to watchlist
ar: إضافة إلى قائمة المشاهدة
fr: Ajouter à la préféré

source: Added to Watchlist
ar: تمت الإضافة إلى قائمة المشاهدة
fr: Ajouté à la préféré

# added_to_wishlist
source: Added to watchlist
ar: تمت الإضافة إلى قائمة المشاهدة
fr: Ajouté à la préféré

# added_to_wishlistt
source: Added to watchlist
ar: تمت الإضافة إلى قائمة المشاهدة
fr: Ajouté à la préféré

source: ago
ar: منذ
fr: il y a

# app_name
source: Kidsflix Club
ar: نادي Kidsflix

source: Are you sure ?
ar: هل أنت متأكد ؟
fr: Êtes-vous sûr ?

source: By continuing you agree to our Terms of Use and acknowledge that you have read our Privacy Policy
ar: من خلال الاستمرار، فإنك توافق على شروط الاستخدام الخاصة بنا وتقر بأنك قد قرأت سياسة الخصوصية الخاصة بنا
fr: En continuant, vous acceptez nos conditions d'utilisation et reconnaissez avoir lu notre politique de confidentialité

source: Cancel
ar: إلغاء
fr: Annuler

source: Cancel subscription
ar: إلغاء الاشتراك
fr: Annuler l'abonnement

source: Change Language
ar: تغيير اللغة
fr: Changer de langue

# change_languagee
source: Change Language
ar: تغيير اللغة
fr: Changer de langue

# choose_nlanguage
source: Choose Language
ar: اختر اللغة
fr: Choisir Langue

source: Click here to watch your purchase history
ar: اضغط هنا لمشاهدة تاريخ شرائك
fr: Cliquez ici pour consulter votre historique d'achat

source: Continue Watching
ar: استمر في المشاهدة
fr: Continuer à regarder

# continue_with_google
source: Continue with
ar: استمرار مع
fr: Continuez avec

source: day
ar: يوم
fr: jour

source: Delete Account
ar: حذف الحساب
fr: Supprimer le compte

# delete_accountt
source: Delete Account
ar: حذف الحساب
fr: Supprimer le compte

# delete_accounttt
source: Delete Account
ar: حذف الحساب
fr: Supprimer le compte

source: Desc
ar: وصف

# delete_account_pop
source: assets/images/delete_account_pop.png
ar: assets/images/delete_account_pop_ar.png
fr: assets/images/delete_account_pop_fr.png

# logout_account_pop
source: assets/images/pop_logout_img.png
ar: assets/images/pop_logout_img_ar.png
fr: assets/images/pop_logout_img_fr.png

# sub_now
source: assets/images/sub_now_en.png
ar: assets/images/sub_now_ar.png
fr: assets/images/sub_now_fr.png

source: Duration
ar: المدة
fr: Durée

source: Edit Number
ar: تعديل الرقم
fr: Modifier le numéro

source: Edit Profile picture
ar: تعديل صورة الملف الشخصي
fr: Modifier la photo de profil

source: Email ID
ar: البريد الإلكتروني
fr: Identifiant de messagerie

source: Enter Mobile Number
ar: أدخل رقم الهاتف
fr: Entrez le numéro de portable

source: Enter pin received via SMS
ar: ادخل الرقم السري الذي تم استلامه عبر الرسالة القصيرة
fr: Entrez le code PIN reçu par SMS

source: Enter Registered Mobile Number
ar: أدخل رقم الهاتف المسجل
fr: Entrez le numéro de portable enregistré

source: Find this amazing content at
ar: ابحث عن هذا المحتوى المذهل على
fr: Trouvez ce contenu incroyable sur

# first_fragment_label
source: First Fragment
ar: first_fragment_label
fr: Premier fragment

source: Get access to ad-free and premium content
ar: احصل على المحتوى المميز وبدون إعلانات
fr: Accédez à du contenu premium et sans publicité

source: Get KidsFlix Premium
ar: احصل على KidsFlix المميز
fr: Obtenez KidsFlix Premium

source: Get otp
ar: احصل على OTP
fr: Obtenir otp

source: Hey there Stay tuned for the latest Updates!!
ar: مرحبا، تابع معنا للحصول على آخر التحديثات !!
fr: Salut, restez à l'écoute des dernières mises à jour !!

source: Home
ar: الرئيسية
fr: Accueil

source: hour
ar: ساعة
fr: heure

source: I agree to
ar: أوافق على
fr: J'accepte les

# i_am_18_or_above_and_i_agree_to_terms_conditions
source: Terms & Conditions
ar: الشروط والأحكام
fr: conditions générales

source: It seems you don’t have any active plan click below button to activate your plan
ar: يبدو أنك لا تملك أي اشتراك نشط، اضغط على الزر أدناه لتفعيل خطة اشتراكك
fr: Il semble que vous n'ayez aucun plan actif, cliquez sur le bouton ci-dessous pour activer votre plan

source: just now
ar: فقط الان
fr: à l'instant

source: Keep track of your favourite rhymes documentaries, songs you want to watch!!
ar: أفضل الأناشيد، الوثائقيات، والأغاني التي تود مشاهدتها !!
fr: Gardez une trace de vos documentaires de rimes préférés, des chansons que vous voulez regarder !!

source: Kidsflix Premium
ar: Kidsflix مميز

source: Link
ar: ربط
fr: Lien

source: Link Portal Subscription
ar: ربط اشتراك البوابة
fr: Lien d'abonnement au portail

# link_portal_subscriptionn
source: Link Portal Subscription
ar: رابط بوابة الاشتراك
fr: Lien d'abonnement au portail

source: Loading your next video ...
ar: جارٍ تحميل الفيديو التالي
fr: Chargement de votre prochaine vidéo...

source: Login / Register
ar: تسجيل الدخول / التسجيل
fr: Connexion / Inscription

source: Login / Subscribe
ar: تسجيل الدخول / الاشتراك
fr: Connexion / Abonnez-vous

source: Logout
ar: تسجيل الخروج
fr: Déconnexion

# lorem_ipsum
source: Lorem ipsum dolor sit amet, consectetur adipiscing elit. Nam in scelerisque sem. Mauris volutpat
ar: ستبدأ عضويتك في Kidsflix فورا بعد الشراء وتتجدد كل شهر أو كل 6 أشهر، حسب نوع الاشتراك الذي تختاره. يمكنك إدارة اشتراكك وإيقاف التجديد التلقائي في أي وقت من خلال Play store. سيتم دفع اشتراك Kidsflix بعملتك المحلية، باستخدام أسعار الصرف التي يحددها Google Play. سيتم معالجة مدفوعاتك بواسطة Google Play خلال 24 ساعة من نهاية الاشتراك الحالي. يمكنك إلغاء الاشتراك بسهولة في أي وقت باستخدام قسم العضوية في الملف الشخصي والذي سيعيد توجيهك إلى صفحة اشتراك Play store بعد إجراء الشراء.

source: minute
ar: دقيقة

# minutee
source: minute
ar: دقيقة

source: Mobile Number
ar: رقم الهاتف
fr: Numéro de portable

# mobile_numberr
source: Mobile Number
ar: رقم الهاتف
fr: Numéro de portable

source: My Account
ar: حسابي
fr: Mon compte

source: My Subscription
ar: اشتراكي
fr: Mon abonnement

source: N/A
ar: غير متاح

# n_aa
source: N/A
ar: غير متاح

# n_aaa
source: N/A
ar: غير متاح

source: Name
ar: الاسم
fr: Nom

source: Next
ar: التالي
fr: Suivant

source: Next Billing Date
ar: تاريخ الفوترة التالي
fr: Prochaine date de facturation

# notification
source: Notifications
ar: الإشعارات

# notificationnn
source: Notification
ar: الإشعارات

source: Notifications
ar: الإشعارات

source: Ooops !! Nothing found
ar: عفوا !! لم يتم العثور على شيء
fr: Oups !! Rien trouvé

source: Options
ar: الخيارات

# optionse
source: Options
ar: الخيارات

# optionss
source: Options
ar: الخيارات

# optionsss
source: Options
ar: الخيارات

source: or
ar: أو
fr: ou

source: Play Game
ar: العب لعبة
fr: Jouer au jeu

source: Please accept terms and conditions
ar: برجاء الموافقة على الشروط والأحكام
fr: Veuillez accepter les conditions générales

source: Please enter number
ar: يرجى إدخال الرقم
fr: Veuillez saisir un numéro

source: Please enter the otp sent to your registered mobile number
ar: يرجى إدخال رمز التحقق OTP المرسل إلى رقم هاتفك المسجل
fr: Veuillez saisir l'otp envoyé à votre numéro de portable enregistré

source: Please Enter valid Number
ar: يرجى إدخال رقم صحيح
fr: Veuillez saisir un numéro valide

# please_enter_valid_numberr
source: Please enter valid number
ar: يرجى إدخال رقم صحيح
fr: Veuillez saisir un numéro valide

source: Please enter your birth year
ar: الرجاء إدخال سنة ميلادك
fr: Veuillez saisir votre année de naissance

# please_login_first_to_continue
source: Login Required !!
ar: تسجيل الدخول مطلوب !!
fr: Connexion requise !!

source: Prepaid and subscription plans available on discounted price. Price starts at $5/month $2/month
ar: متاح خطط الدفع المسبق وخطط الاشتراك بأسعار مخفضة والسعر يبدأ من
fr: Plans prépayés et par abonnement disponibles à prix réduit. Le prix commence à

source: Previous
ar: السابق
fr: Précédent

# privacy_and_t_amp_c
source: Privacy and T&C
ar: الخصوصية والشروط والأحكام
fr: Confidentialité et CGU

source: Profile
ar: الملف الشخصي
fr: Profil

source: Rate Our App
ar: قيم تطبيقنا
fr: Évaluez notre application

source: Recently Searched
ar: تم البحث عنها مؤخرا
fr: Recherche récente

# recently_searchedd
source: Recently Searched
ar: تم البحث عنها مؤخرا
fr: Recherche récente

# recently_searcheddd
source: Recently Searched
ar: تم البحث عنها مؤخرا
fr: Recherche récente

source: Remove from continue watch
ar: إزالة من متابعة المشاهدة
fr: Supprimer de continuer à regarder

source: Remove from watchlist
ar: إزالة من قائمة المشاهدة
fr: Supprimer de la préféré

# remove_from_wishlist
source: Remove from watchlist
ar: إزالة من قائمة المشاهدة
fr: Supprimer de la préféré

source: Resend OTP
ar: إعادة إرسال OTP
fr: Renvoyer l'OTP

source: Resend OTP in
ar: إعادة إرسال OTP في
fr: Renvoyer l'OTP dans

# resend_otp_inn
source: Resend OTP in
ar: إعادة إرسال OTP في
fr: Renvoyer l'OTP dans

source: Result for '
ar: النتيجة لـ
fr: Résultat pour '

source: Search
ar: بحث
fr: Recherche

# second_fragment_label
source: Second Fragment
ar: second_fragment_label
fr: Deuxième fragment

source: seconds
ar: ثواني
fr: secondes

# secondss
source: seconds
ar: ثواني
fr: secondes

source: Select display Picture
ar: اختر صورة العرض
fr: Sélectionnez l'image d'affichage

source: Select Operator
ar: اختر المشغل
fr: Sélectionnez l'opérateur

source: Settings
ar: الإعدادات
fr: Paramètres

# settingss
source: Settings
ar: الإعدادات
fr: Paramètres

source: Share
ar: مشاركة
fr: Partager

# sharee
source: Share
ar: مشاركة
fr: Partager

# shareee
source: Share
ar: مشاركة
fr: Partager

# shareeee
source: Share
ar: مشاركة
fr: Partager

# sharer
source: Share
ar: مشاركة
fr: Partager

source: Sign up with
ar: التسجيل مع
fr: Inscrivez-vous avec

source: SKIP
ar: تخطي
fr: PASSER

source: Something went wrong
ar: حدث خطأ ما
fr: Quelque chose s'est mal passé

# something_went_wrongg
source: Something went wrong
ar: حدث خطأ ما
fr: Une erreur s'est produite

source: Started On
ar: بدأ في
fr: Démarré le

source: Starter Pack
ar: حزمة البداية
fr: Pack de démarrage

source: Submit
ar: إرسال
fr: Envoyer

source: Subscription Details
ar: تفاصيل الاشتراك
fr: Détails de l'abonnement

source: Subscription Status
ar: حالة الاشتراك
fr: Statut de l'abonnement

source: Subtitle
ar: العنوان الفرعي
fr: Sous-titre

source: The app is specially designed for Kids. Please select Kid's birth year
ar: تم تصميم التطبيق خصيصا للأطفال. الرجاء تحديد سنة ميلاد الطفل
fr: L'application est spécialement conçue pour les enfants. Veuillez sélectionner l'année de naissance de l'enfant

source: The information is not stored and is only used to confirm to enable certain functionality.
ar: لا يتم تخزين المعلومات ويتم استخدامها فقط للتأكيد لتمكين وظائف معينة.
fr: Les informations ne sont pas stockées et ne sont utilisées que pour confirmer l'activation de certaines fonctionnalités.

# timee
source: Time
ar: الوقت
fr: Heure

source: Title
ar: العنوان
fr: Titre

# title_activity_home
source: HomeActivity
ar: title_activity_home
fr: AccueilActivité

# title_activity_main2
source: MainActivity2
ar: title_activity_main2

# titlee
source: Title
ar: العنوان
fr: Titre

# titleee
source: Title
ar: العنوان
fr: Titre

source: Unsubscribe
ar: إلغاء الاشتراك
fr: Se désabonner

source: v 1.2.0
ar: الإصدار 1.2.0

source: Verify Otp
ar: التحقق من OTP
fr: Vérifier l'OTP

source: Video Quality
ar: جودة الفيديو
fr: Qualité vidéo

# video_qualityy
source: Video Quality
ar: جودة الفيديو
fr: Qualité vidéo

source: Watchlist
ar: قائمة المشاهدة
fr: préféré

# watchlistt
source: Watchlist
ar: قائمة المشاهدة
fr: préféré

# watchlistttt
source: WatchList
ar: قائمة المشاهدة
fr: préféré

source: Weekly 10$
ar: أسبوعي 10$
fr: Hebdomadaire 10$

source: Welcome aboard, young explorers! Let's embark on the KidsFlix Club journey of stories, rhymes, games, and documentaries!
ar: مرحبًا بكم على متن المستكشفين الشباب! هيا بنا نبدأ رحلة KidsFlix Club المليئة بالقصص والأناشيد والألعاب والأفلام الوثائقية!
fr: Bienvenue à bord, jeunes explorateurs ! Embarquons pour le voyage du KidsFlix Club d'histoires, de comptines, de jeux et de documentaires !

source: Welcome to the new home of all your favourite Kids Content. Full with Learnings Entertainment & Premium Content
ar: مرحبا بكم في التطبيق الجديد لكل المحتوى المفضل للأطفال. مليء بالتعليم والترفيه والمحتوى المميز
fr: Bienvenue dans la nouvelle maison de tout votre contenu pour enfants préféré. FrançaisComplet avec des divertissements et du contenu premium

source: Yes
ar: نعم
fr: Oui

# continue_with_apple
source: Continue with
ar: تواصل مع Apple
fr: Apple Continuez avec

source: You don't have a valid Portal Subscription
ar: ليس لديك اشتراك ساري
fr: Vous n'avez pas d'abonnement au portail valide

source: You have successfully linked your Portal Subscription
ar: لقد قمت بربط اشتراكك بنجاح
fr: Vous avez lié avec succès votre abonnement au portail

source: Your Kidsflix membership will start instantly after the purchase and renews each month or after 6 months, depending on the billing cycle you choose. You can manage your subscription and turn off auto-renew at any time through the Play Store. Your kidsflix membership will be billed in your local currency, using exchange rates set by Google Play. Your payments will be processed by Google Play within 24 hours of the end of the current billing cycle. You can easily cancel the subscription at any time by using membership section of the profile which will redirect you to play store subscription page after you make the purchase.
ar: ستبدأ عضويتك في Kidsflix فورا بعد الشراء وتتجدد كل شهر أو كل 6 أشهر، حسب نوع الاشتراك الذي تختاره. يمكنك إدارة اشتراكك وإيقاف التجديد التلقائي في أي وقت من خلال Play store. سيتم دفع اشتراك Kidsflix بعملتك المحلية، باستخدام أسعار الصرف التي يحددها Google Play. سيتم معالجة مدفوعاتك بواسطة Google Play خلال 24 ساعة من نهاية الاشتراك الحالي. يمكنك إلغاء الاشتراك بسهولة في أي وقت باستخدام قسم العضوية في الملف الشخصي والذي سيعيد توجيهك إلى صفحة اشتراك Play store بعد إجراء الشراء.
fr: Votre abonnement Kidsflix commencera instantanément après l'achat et se renouvellera chaque mois ou après 6 mois, selon le cycle de facturation que vous choisissez. Vous pouvez gérer votre abonnement et désactiver le renouvellement automatique à tout moment via le Play Store. Votre abonnement kidsflix sera facturé dans votre devise locale, en utilisant les taux de change définis par Google Play. Vos paiements seront traités par Google Play dans les 24 heures suivant la fin du cycle de facturation en cours. Vous pouvez facilement annuler l'abonnement à tout moment en utilisant la section abonnement du profil qui vous redirigera vers la page d'abonnement du Play Store après avoir effectué l'achat.

source: Header
fr: En-tête

source: Hello blank fragment
fr: Bonjour fragment vierge

source: History Item
fr: Historique

source: RegisterFragment
fr: Inscrivez-vousFragment
